<?php
if(!empty($_POST["text"])){
$slova = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я',
"Я", "Ю", "Э", "Ь", "Ы", "Ъ", "Щ", "Ш", "Ч", "Ц", "Х", "Ф", "У", "Т", "С", "Р", "П", "О", "Н", "М", "Л", "К", "Й", "И", "З", "Ж", "Ё", "Е", "Д", "Г", "В", "Б", "А",];
$eng = ["a",   "b",   "v", "g", "d", "e", "yo", "zh", "z", "i", "y", "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f", "h", "c", "ch", "shh", "sh", "'", "i", "/", "e"," yu", "ya"
       ,"A",   "B",   "V", "G", "D", "E", "Yo", "Zh", "Z", "I", "J", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F", "X", "C", "Ch",  "Shh", "Sh", "Y", "E",          "Yu" , "Ya",];
$print=str_replace($slova,$eng,$_POST["text"]);

echo $_POST['text']."<br>";
echo $print;

}
?>
<form method="post">
<textarea name="text">
</textarea>
<input type="submit" value="отправить">
</form>
